СистемаВходаПользователей/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СистемаВходаПользователей/Catalogs/ОбедыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ОбедыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбеда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбедов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказавший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СистемаВходаПользователей/CommonModules/РаботаСДанными/Ext/Module.bsl
Процедура ПередатьАргументы (НачалоРаботы, КонецРаботы) экспорт 
	
 	НачалоРаботы = Константы.НачалоРаботы.Получить();
 	КонецРаботы = Константы.КонецРаботы.Получить();

КонецПроцедуры

Функция СинхронизироватьПользователя(ЭтоАдмин, ВыбранОбед) Экспорт
	
	УИД = ПользователиИнформационнойБазы.ТекущийПользователь();	
    Эл = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",УИД.УникальныйИдентификатор);
	ТекДата = НачалоДня(ТекущаяДата());

		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбедыПользователей.Заказавший КАК Заказавший,
	                      |	ОбедыПользователей.Дата КАК Дата
	                      |ИЗ
	                      |	Справочник.ОбедыПользователей КАК ОбедыПользователей
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	                      |		ПО ОбедыПользователей.Заказавший = Пользователи.Ссылка
	                      |ГДЕ
	                      |	ОбедыПользователей.Заказавший = &Эл
	                      |	И ОбедыПользователей.Дата = &ТекущаяДата"
	);
	Запрос.Параметры.Вставить("Эл", Эл);
	Запрос.Параметры.Вставить("ТекущаяДата", ТекДата);
	РезультатЗапроса = Запрос.Выполнить();
			
    Если Эл.Пустая() Тогда
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		НовыйПользователь.УникальныйИдентификатор = УИД.УникальныйИдентификатор;
		НовыйПользователь.Администратор = Ложь;
		НовыйПользователь.Записать();
		ВыбранОбед = Ложь;
		Возврат НовыйПользователь.Ссылка;
	Иначе
		Если РезультатЗапроса.Пустой() Тогда
			ВыбранОбед = Ложь;
		КонецЕсли;
		ЭтоАдмин = Эл.Администратор;
		Возврат ЭтоАдмин;
	КонецЕсли;
	
	
КонецФункции

Процедура ОбработкаОбеда(Элемент) Экспорт
	Если Элемент = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сегодня без трапезы"; 
		Сообщение.Сообщить();
    Иначе
        ОбедПользователя = Справочники.ВариантыОбедов.НайтиПоКоду(Элемент);
		Объект = ОбедПользователя.ПолучитьОбъект();
		Объект.Рейтинг = Объект.Рейтинг + 1;
		Объект.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сегодня на обед " + ОбедПользователя.Наименование;
		Сообщение.Сообщить();
		
       	УИД = ПользователиИнформационнойБазы.ТекущийПользователь();	
   		Юзер = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",УИД.УникальныйИдентификатор);
		
		Обед = Справочники.ОбедыПользователей.СоздатьЭлемент();
		Обед.Дата = ТекущаяДата();
		Обед.Заказавший = Юзер;
		Обед.ВариантОбеда = ОбедПользователя;
		Обед.Записать();
;
 
    КонецЕсли;
КонецПроцедуры
